app/controllers/songs_controller.rb

  def upload
    CSV.foreach(params[:file].path, headers: true) do |song|
      Song.create(title: song[0],
       artist: Artist.find_by_or_create(name: song[1]) )
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2019-08-19 10:09:33.344520"], ["updated_at", "2019-08-19 10:09:33.344520"]]
INSERT INTO "songs" ("title", "created_at", "updated_at", "artist_id") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["created_at", "2019-08-19 10:09:33.350028"], ["updated_at", "2019-08-19 10:09:33.350028"], ["artist_id", 137]]